# каскадная модел 
# спираль
# scrum, agile 
# прототип 



# группа 1 - avtoservis (24/7)
    #  function_1 - Услуга мастера (список, мастер - услуга, запись на услугу, цена, рейтинг, контакт мастера, выездное обслужывание)
    #  function_2 - диагностика (вид, марка, год авто(выбор), часть авто)
    #  function_3 - магазин (автозапчасти, аксесуары, пред заказ, доставка за границы, к порогу, +обслуга)
    #  function_4 - БД (мастер, клиент)

# группа 2 - салон красоты
    #  function_1 - регистрация (Мастера , клиента, вход, (личный каинет (мастера - ФИО, фото, снимки работ, возраст, контакты, рейтинг) клиента - ФИО,контакт, пол)
    #  function_2 - галерея (мастер, услуга (цена), локация, лайк, сохранить, шаре)
    #  function_3 - Акции, скидки, 
    #  function_4 - Рейтинг (масреров, услуг (цена), салона, санитарный)

# группа 3 - Недвижымость
    #  function_1 - Рейтинг 
    #  function_2 - Регистрация 
    #  function_3 - Загрузка проектов
    #  function_4 - Библиотека (книг)

# группа 4 - Аpteka
    #  function_1 - Регистрация (узер, аптека)
    #  function_2 - Поиск (локация, наз лекарств) филтрация (цена, ликация, рейтинг)
    #  function_3 - БД (лекарсва, регистрация, аптека, локация, контакты)
    #  function_4 - Транзакция фин (денег, PAYME, предоплата)

# группа 5 - Таможня?
    #  function_1 - Регистрация (клиен - ФИО, контакты, серия фото, паспорта, индекс получателя)
    #  function_2 - БД (товары, карзинка, транзкции, история заказов)
    #  function_3 - Поиск (товары) филтрация (категории, странам, цена)
    #  function_4 - Доставка (оформление заказа, услуги, оффер (скидки), акции, тарифы)


# Проблема ? 